Repository: TrainingB/Clembot
Catalog: locale/*/LC_MESSAGES/meowth.po
Languages: fr, it

source: Received admin command {command} from unauthorized user, {user}!
fr: Commande d'administrateur {command} reçue à partir d'un utilisateur non autorisé {user}!
it: Ho ricevuto un comando per admin {command} da un utente non autorizzato {user}!

source: Meowth! "{entered_word}" is not a Pokemon! Did you mean "{corrected_word}"?
fr: Meowth! "{entered_word}" n'est pas un Pokémon! Voulez-vous dire "{corrected_word}"?
it: “{entered_word}” non è un Pokémon! Forse intendevi “{corrected_word}”?

source: Meowth! "{entered_word}" is not a Pokemon! Check your spelling!
fr: Meowth! "{entered_word}" n'est pas un Pokémon! Vérifiez l'écriture!
it: “{entered_word}” non è un Pokemon! Controlla la tua ortografia!

source: This channel timer has expired! The channel has been deactivated and will be deleted in 5 minutes. To reactivate the channel, use !timerset to set the timer again.
fr: Ce salon de raid a expiré! Le salon a été désactivé et sera supprimé dans 5 minutes. Pour réactiver le salon, utilisez **!timerset** pour réinitialiser la minuterie.v
it: Questo timer del canale è scaduto! Il canale è stato disattivato e verrà eliminato in 5 minuti. Per riattivare il canale, utilizza !Timerset e imposta nuovamente il timer.

source: Meowth! That's right!
fr: Meowth! Aucun soucis!
it: Giusto!

source: Meowth! That's right! I've been rebooted! You don't need to do anything this time, but you may find some commands don't respond in currently active channels, or the channels may not delete as expected. Sorry for any inconvenience!
fr: Meowth! J'ai été redémarré! Vous n'avez pas besoin de faire de quoi cette fois, mais c'est possible que certaines commandes ne fonctionnent pas dans les salons actuellement actifs, ou les salons peuvent ne pas supprimer comme prévu. Désolé pour tout inconvénient!
it: Giusto! Sono stato riavviato! Non è necessario eseguire nulla questa volta, ma è possibile che alcuni comandi non rispondano nei canali attualmente attivi o che i canali non siano eliminati come previsto. Ci dispiace per qualsiasi inconveniente!

source: Meowth! I'm Meowth, a Discord helper bot for Pokemon Go communities, and someone has invited me to your server! Type !help to see a list of things I can do, and type !configure in any channel of your server to begin!
fr: Meowth! Je suis Meowth, un robot qui aide les communautés Pokémon Go sur Discord, et quelqu'un m'a invitié à votre serveur! Tapez **!help** pour voir une liste de choses que je peux faire, et tapez **!configure** dans n'importe quelle salon de votre serveur pour commencer!
it: Sono Meowth, un bot di supporto per Discord e la communities di Pokemon GO, e qualcuno mi ha invitato nel tuo server! digita !help per visualizzare la lista di comandi disponibili, e digita !configure in qualsiasi canale per iniziare!

source: __**Meowth Configuration**__ Meowth! That's Right! Welcome to the configuration for Meowth the Pokemon Go Helper Bot! I will be guiding you through some setup steps to get me setup on your server. **Team Assignment Configuration** First, I have a feature that allows users to assign their Pokemon Go team using roles. If you have a bot that handles this already, or you don't want this feature, type N, otherwise type Y to enable the feature!
fr: __**Configuration de Meowth**__ Meowth! Bienvenue dans la configuration de Meowth, le robot assistant de Pokémon Go! Je vais vous guider à travers certaines étapes d'installation pour me configurer sur votre serveur. **Configuration de l'équipe** Tout d'abord, j'ai une fonctionnalité qui permet aux utilisateurs d'assigner leur équipe Pokémon Go en utilisant les rôles. Si vous avez un robot qui le gère déjà, ou si vous ne voulez pas cette fonctionnalité, tapez N, sinon tapez Y pour activer la fonctionnalité!
it: __**Configurazione di Meowth**__ Giusto! Benvenuti nelle configurazioni di Meowth, il Pokemon Go Helper Bot! Ti guiderò attraverso passo passo all’installazione e al setup sul tuo server. **Configurazione Assegnamento Team** Per prima cosa, ho un funzione che permette agli utenti di assegnarsi al proprio Team di Pokemon GO usando delle regole. Se hai già un bot che si occupa di questo, o non vuoi questa funzionalità digita N, altrimenti primi Y per abilitare questa funzione!

source: Meowth! Team assignments enabled! Please make sure that my role is moved to the top of your server role hierarchy, or at least above your team roles. Your team roles must be 'mystic', 'valor', and 'instinct' and *must* be lowercase. I should have made some for you if you didn't have them, you can set their colors and other settings later.
fr: Meowth! Les affectations d'équipe sont activées! Assurez-vous que mon rôle est déplacé vers le haut de votre hiérarchie de rôle de serveur, ou au moins au-dessus de vos rôles d'équipe. Les rôles de vos équipes doivent être «mystic», «valor» et «instinct» en anglais et *doivent* être en minuscules. J'aurais dû en faire quelques-unes si vous ne les avez pas, vous pouvez régler leurs couleurs et autres paramètres plus tard.
it: Assegnamento Team abilitato! Per favore assicurati che il mio ruolo è stato messo al top della tua gerarchia dei ruoli del server, o quanto meno più in alto dei ruoli dei vari team. I tuoi ruoli dei team dovranno essere ‘mystic’, ‘valor’, e ‘instinct’ e *dovranno* essere tutti minuscoli. Se non li avevi già ne ho creati alcuni per te, potrai impostare il loro colore dalle impostazioni più tardi.

source: **Welcome Message Configuration** Next, I have a feature where I welcome new members to the server with a short welcome message in a channel or with a direct message. If you have a bot that handles this already, or if you don't want this feature, type N, otherwise type Y to enable this feature!
fr: **Configuration des messages de bienvenue** Ensuite, j'ai une fonctionnalité où j'accueille de nouveaux membres au serveur avec un petit message de bienvenue dans un salon ou avec un message direct. Si vous avez déjà un robot qui le gère, ou si vous ne voulez pas cette fonctionnalité, tapez N, sinon tapez Y pour activer cette fonctionnalité!
it: **Configurazione Messaggio Di Benvenuto** Avanti, Ho un dove io do il benvenuto ai nuovi utenti del tuo server con un breve messaggio di benvenuto in un canale o con un messaggio privato. Se hai già un bot che si occupa di questo, o non vuoi questa funzionalità digita N, altrimenti primi Y per abilitare questa funzione!

source: Sample message:```Meowth! Welcome to [SERVER], @[MEMBER]! Set your team by typing '!team mystic' or '!team valor' or '!team instinct' without quotations. If you have any questions just ask an admin.```
fr: Exemple de message:```Meowth! Bienvenue sur [SERVER], @[MEMBER]! Choisir votre équipe en tapant «!team mystic» ou «!team valor» ou «!team instinct» sans guillemets. Si vous avez des questions, demandez à un administrateur.```
it: Messaggio di esempio:```Benvenuto in [SERVER], @[MEMBER]! Imposta il tuo team digitando ‘!team mystic’ o ‘!team valor’ o ‘!team instinct’ senza le virgolette. Per qualsiasi domanda chiedi pure ad un amministratore.```

source: Sample message:```Meowth! Welcome to [SERVER], @[MEMBER]! If you have any questions just ask an admin.```
fr: Exemple de message:```Meowth! Bienvenue sur [SERVER], @[MEMBER]! Si vous avez des questions, demandez à un administrateur.```
it: Messaggio di esempio:```Benvenuto in [SERVER], @[MEMBER]! Per qualsiasi domanda chiedi pure ad un amministratore.```

source: Meowth! Welcome message enabled! **Welcome Message Channel Configuration** Now I need to know what channel you want me to post these welcome messages in. Reply with a channel name or 'DM' if you would rather I direct message the user.
fr: Meowth! Message de bienvenue activé! **Configuration du salon de message de bienvenue** Maintenant, j'ai besoin de savoir dans quel salon vous voulez publier ces messages de bienvenue. Répondez avec le nom du salon, ou avec «DM» si vous préférez que je communique directement avec l'utilisateur.
it: Messaggio di benvenuto abilitato! **Configurazione canale messaggio di benvenuto** Ora ho bisogno di sapere il nome del canale nel quale vorresti io postassi questo messaggio di benvenuto. Rispondi con un nome di un canale o con ’DM’ se vuoi che io mandi un messaggio privato direttamente all’utente.

source: **Main Function Configuration** Meowth! Alright. Next I just want to check that you want to enable *any* of my main functions. These include assigning roles for each Pokemon a user wants, wild spawn reports, creating channels for raids, and keeping track of users coming to each raid. If you don't want me to do *any* of that, type N, otherwise type Y to start enabling my main functions!
fr: **Configuration de la fonction principale** Meowth! Bien. Ensuite, je veux simplement vérifier que vous voulez activer *toutes* mes principales fonctions. Ceux-ci incluent l'attribution de rôles pour chaque Pokémon qu'un utilisateur voudrait, les rapports de Pokémon sauvages, la création de salons pour les raids et le suivi des utilisateurs qui arrivent à chaque raid. Si vous ne voulez pas que je fasse au moins *un* de cela, tapez N, sinon tapez Y pour commencer à activer mes principales fonctions!
it: **Configurazione Funzioni Principali** Bene. Ora voglio controllare che tu voglia abilitare *tutte* le mie funzioni principali. Questo include l’assegnamento di ruoli per ogni Pokémon che un utente vuole, le segnalazioni di spawn di Pokémon selvatici, creare canali per i raid, e tenere traccia degli utenti in fase di organizzazione di un raid. Se vuoi che io *non faccia* qualcosa di queste digita N, altrimenti digita Y per iniziare ad abilitare le mie funzioni principali!

source: Meowth! Okay. Now make sure that I have either an admin role on your server, or at least a role with these permissions: 'read messages', 'send messages', 'embed links', 'manage roles', and 'manage channels'. Also, check if my role is at the top of your server role hierarchy.
fr: Meowth! D'accord. Maintenant, assurez-vous que j'ai un rôle d'administration sur votre serveur, ou au moins un rôle avec ces autorisations: «lire les messages», «envoyer des messages», «intégrer des liens», «gérer les rôles» et «gérer les salons». Vérifiez également si mon rôle est au sommet de votre hiérarchie de rôle de serveur.
it: Okay. Ora assicurati che io abbia un ruolo da admin nel tuo server o almeno un ruolo con queste autorizzazioni: “leggere i messaggi”, “inviare i messaggi”, “incorporare i link”, “gestire i ruoli” e “gestire i canali ‘. Inoltre, controlla se il mio ruolo è in cima alla gerarchia del ruolo del server.

source: **City Channel Configuration** Meowth! Next, I need to know which channels will be used for raid and/or wild reports. If your server covers only one community, that's probably your server's default channel. If you cover multiple communities, you should probably have a channel for each community that only those with roles for that community can see. Otherwise your users could be spammed with notifications for raids that are not relevant to them!
fr: **Configuration des salons de villes** Meowth! Ensuite, je dois savoir quels salons seront utilisés pour les rapports de raid et/ou Pokémon sauvages. Si votre serveur ne couvre qu'une seule communauté, c'est probablement le salon par défaut de votre serveur. Si vous couvrez plusieurs communautés, vous devriez probablement avoir un salon pour chaque communauté que seuls ceux qui ont des rôles pour cette communauté peuvent voir. Sinon, vos utilisateurs pourraient être «spammés» avec des notifications de raids qui ne leur sont pas pertinentes!
it: ** Configurazione Canale Della Città ** Ora, ho bisogno di sapere in quali canali verranno utilizzati per le segnalazioni dei raid e/o dei Pokémon selvatici. Se il tuo server copre solo una community, questo sarà probabilmente il tuo canale di default. Se invece il tuo server copre più di una community, tu dovrai probabilmente avere un canale per ogni community nel quale solo chi ha un ruolo per quella community potrà vedere i raid. Altrimenti i tuoi utenti potrebbero spammare notifiche di raid alle quali una community potrebbe non essere interessata!

source: Here's what I need: a list of channels in your server that will be used for raid and/or wild reports. Give them in this format: channelname, channelname, channelname
fr: Voici ce que j'ai besoin: une liste des salons dans votre serveur qui sera utilisé pour les rapports de raids et/ou Pokémon sauvages. Donnez-les dans ce format: nom-de-salon, nom-de-salon, nom-de-salon
it: Questo è quello di cui ho bisogno: una lista di canali del tuo server che verranno utilizzati per segnalare i raid e/o i Pokémon selvatici. Scrivimeli utilizzando questo formato: nomecanale, nomecanale, nomecanale

source: In other words, the name of each channel, each separated by a comma and a single space. If you do not require raid and wild reporting and are only requiring want/unwant, reply with 'N'; however, want/unwant is quite limited without raid or wild reporting.
fr: En d'autres termes, le nom de chaque salon, chacun séparé par une virgule et un espace unique. Si vous n'avez pas besoin de raid et de rapports sauvages et ne requiert que «want/unwant», répondez avec N; Cependant, le «want/unwant» est assez limité sans raid ou rapports sauvages.
it: In altre parole, il nome di ogni canale, separato con una virgola e un singolo spazio dagli altri. Se non vuoi le segnalazioni di raid e/o Pokémon selvatici ma vuoi solo le segnalazioni di Voglio/NonVoglio, rispondi con ’N’; altrimenti Voglio/NonVoglio sarà abbastanza limitata senza la segnalazione di raid e/o Pokémon selvatici.

source: Meowth! Great! Looks like all of these are names of channels in your server.
fr: Meowth! Génial! On dirait que tous ces noms sont des noms des salons dans votre serveur.
it: Ottimo! Sembra che tutti questi siano nomi di canali nel tuo server.

source: Meowth! Something went wrong! Please type !configure to start over! Make sure the channels above are created already!
fr: Meowth! Il y a eu un problème! Tapez **!configure** pour recommencer! Assurez-vous que les salons ci-dessus sont déjà créés!
it: Qualcosa è andato storto! Per favore digita !configure per ricominciare! Assicurati che i canali sopra siano già creati!

source: **City Location Configuration** Meowth! Alright, we need to set starting locations for each of the channels you just mentioned in the SAME ORDER you typed before. This is what I use to generate Google Maps links to give people directions to raids and spawns! Knowing what town everything is in is often good enough to narrow it down. One way to put it is, for each channel you just listed, I need a location specific enough that I'll know hich First Baptist Church people mean. This is important, so please enter it in just this way. For each channel, give me a location using only letters, no punctuation. So something like 'kansas city mo' or 'hull uk' without the quotes and separate your locations with a comma and single space.
fr: **Configuration des emplacements des villes** Meowth! D'accord, nous devons définir les emplacements de départ pour chacun des salons que vous venez de mentionner dans le MÊME ORDRE que vous avez tapé auparavant. C'est ce que j'utilise pour générer des liens Google Maps pour donner aux gens des instructions pour se rendre aux raids et aux Pokémon sauvages! Savoir dans quelle ville tout se trouve est souvent assez. Une façon de le dire est que, pour chaque salon que vous venez d'énumérer, j'ai besoin d'un emplacement précis pour savoir quelle Église Baptiste les gens font référence. Ceci est important, alors, inscrivez-le de cette façon. Pour chaque chaîne, donnez-moi un emplacement en utilisant uniquement des lettres, pas de ponctuation. Donc, quelque chose comme «laval qc» ou «Hull Royaume-Uni» sans guillemets et séparez vos emplacements avec une virgule et un espace unique.
it: **Configurazione Posizione Città** Bene, Abbiamo bisogno di impostare una località di partenza per ogni canale che hai menzionato prima usando lo STESSO ORDINE. Queste località le uso per generare i link a Google Maps per dare alle persone le indicazioni per raggiungere i raid e gli spawn! Sapere il nome della città in cui tutto questo avviene spesso è abbastanza. Per ogni canale che hai scritto sopra ho bisogno di una località abbastanza specifica per permettermi di trovare il posto corretto. Questo è importante, quindi inseriscile in questo modo. Per ogni canale damme una località usando solo lettere, niente punteggiatura. Esempio: “milano” oppure “roma termini” il tutto va digitato senza apostrofi e separa una località dall’altra tramite una virgola e un solo spazio.

source: Meowth! There weren't the same number of cities and channels! Please type !configure to start over!
fr: Meowth! Il n'y avait pas le même nombre de villes et de salons! Tapez **!configure** pour recommencer!
it: Il numero di canali non corrisponde al numero di città! per favore digita !configure per ricominciare!

source: **Raid Command** Meowth! Alright. Do you want raid reports in these channels? Reply with 'Y' to enable !raid reports, or 'N' to disable !raid
fr: **Commande de raid** Meowth! Bien. Voulez-vous des rapports de raid dans ces salons? Réponde avec 'Y' pour activer les rapports de **!raid**, ou 'N' pour désactiver **!raid**.
it: Bene. Vuoi riportare i raid in questo canale? Rispondi con ‘Y’ per abilitare le segnalazioni tramite il comando !raid, oppure ’N’ per disabilitarli

source: **Timezone Configuration** Meowth! Ok, to finish the raid configuration I need to know what timezone you're in! This will help me coordinate raids for you. The current 24-hr time UTC is {utctime}. How many hours off from that are you? Please enter your answer as a number between -12 and 12.
fr: **Configuration de la fuseau horaire** Meowth! Ok, pour terminer la configuration du raid, j'ai besoin de savoir dans quel fuseau horaire vous êtes! Cela m'aidera à coordonner des raids pour vous. Le UTC actuel de 24 heures est {utctime}. À combien d'heures de différence êtes-vous? Entrez votre réponse avec un nombre entre -12 et 12.
it: **Configurazione Timezone** Ok, per finire la configurazione del raid ho bisogno di sapere in che Timezone ti trovi. Quella corrente 24-hr time UTC è {utctime}. Quante ore ci sono di differenza dal tuo orario corrente? Per favore inserisci un numero compreso tra -12 e 12.

source: Meowth! I couldn't convert your answer to a number! Type !configure in your server to start again.
fr: Meowth! Je n'ai pas pu convertir votre réponse à un nombre! Tapez **!configure** dans votre serveur pour recommencer.
it: Non posso convertire la tua risposta in un numero! Digita !configure nel tuo server per ricominciare.

source: **Wild Command** Meowth! Alright. Do you want wild reports in these channels? Reply with 'Y' to enable !wild reports, or 'N' to disable !wild
fr: **Commande pour Pokémon sauvages** Meowth! Bien. Voulez-vous des rapports sauvages dans ces salons? Répondre avec 'Y' pour activer les rapports **!wild**, ou 'N' pour les désactiver.
it: **Comando Wild** Bene. Vuoi riportare i Pokémon selvatici in questo canale? Rispondi con ‘Y’ per abilitare le segnalazioni tramite il comando !wild, oppure ’N’ per disabilitare il comando

source: Meowth! Ok. Time to do one last check that I have either an admin role on your server, or at least a role with these permissions: 'read messages', 'send messages', 'embed links', 'manage roles', and 'manage channels'. Also, check if my role is at the top of your server role hierarchy. You can restrict me to specific channels by editing channel-specific permissions if you like. **Want/Unwant Configuration** The last thing you should know is that the !want and !unwant commands can produce a lot of clutter if they are allowed on your main channels. I suggest having a dedicated channel for want and unwant. Just type the name or names of the channel(s) you want me to allow. If you type something that isn't a name of an existing channel, I'll create one by that name. If you do not want to enable want/unwant, reply with 'N'.
fr: Meowth! D'accord. C'est le temps de faire une dernière vérification que j'ai un rôle d'administrateur sur votre serveur, ou au moins un rôle avec ces permissions:«lire les messages», «envoyer des messages», «intégrer des liens», «gérer les rôles» et «gérer les salons». Vérifiez également si mon rôle est au sommet de votre hiérarchie de rôle de serveur. Vous pouvez me limiter à des salons spécifiques en modifiant les permissions spécifiques du salon si vous le souhaitez. **Configuration want/unwant** La dernière chose que vous devriez savoir, c'est que les commandes **!want** et **!unwant** peuvent produire beaucoup d'encombrement s'ils sont autorisés dans les salons principaux. Je suggère d'avoir un salon dédié pour want/unwant. Tapez simplement le nom ou les noms des salons que vous souhaitez que je permette. Si vous tapez quelque chose qui n'est pas un nom d'un salon existant, je vais en créer un avec ce nom. Si vous ne voulez pas activer la commande want/unwant, répondez avec N.
it: Ok. È ora di eseguire un ultimo controllo per avere il ruolo di amministratore sul tuo server o almeno un ruolo con queste autorizzazioni: “leggere i messaggi”, “inviare i messaggi”, “incorporare i link”, “gestire i ruoli” e “gestire i canali ‘. Inoltre, controlla se il mio ruolo è in cima alla gerarchia del ruolo del server. Puoi limitarmi a canali specifici modificando le autorizzazioni specifiche del canale se vuoi. **Configurazione Voglio/NonVoglio** L’ultima cosa che dovresti sapere è che i comandi !want e !unwant possono produrre un sacco di confusione se sono consentiti nei tuoi canali principali. Suggerisco di avere un canale dedicato per per Voglio/NonVoglio. Basta digitare il nome o i nomi dei canali che desideri abilitare. Se digitate qualcosa che non è un nome di un canale esistente, ne creerò uno con quel nome. Se non si desidera abilitare Voglio/NonVoglio, digita ’N’.

source: Meowth! You didn't give me enough permissions! Type !configure to start over!
fr: Meowth! Vous ne m'avez pas donné suffisamment de permissions! Tapez **!configure** pour recommencer!
it: Non mi hai dato abbastanza permessi! digita !configure per ricominciare!

source: Meowth! Okay. All of my main functions have been disabled.
fr: Meowth! D'accord. Toutes mes principales fonctions ont été désactivées.
it: Okay. Okay. Tutte le funzioni principali sono state disattivate.
