Repository: TrainingB/Clembot
Catalog: locale/*/LC_MESSAGES/meowth.po
Languages: fr, it

source: **Emojis** Meowth! Alright! I'm ready to go! One more thing. I like to use custom emoji for certain things, especially for displaying type weaknesses for raid bosses! I'm going to send you a .rar file that contains all the emoji I need. There are 23 in all. All you have to do is download, extract, and upload the images to Discord as custom emoji. You can do this all at once, and you can just leave the emoji titles alone! By the way: if you need to change any of these settings, just type !configure in your server and we can do this again.
fr: **Émojis** Meowth! Bien! Je suis prêt à partir! Encore une chose. J'aime utiliser des émojis personnalisés pour certaines choses, en particulier pour afficher les faiblesses pour les Pokémon de raid! Je vais vous envoyer un fichier .rar qui contient tous les émojis dont j'ai besoin. Il y en a 23 au total. Tout ce que vous avez à faire est de télécharger les émojis sur votre ordinateur, de les extraire et de télécharger les images sur Discord comme émoji personnalisé (dans les paramètres du serveur). Vous pouvez le faire tout à la fois, et vous pouvez simplement ne pas changer les titres de ces émojis! Si vous devez changer l'un de ces paramètres, tapez !configure dans votre serveur et nous pouvons le faire à nouveau.
it: **Emojis** Bene! Sono pronto per iniziare! Un’ultima cosa. Mi piacerebbe usare delle emoji personalizzate per alcune cose, per esempio per mostrare le debolezze di un raidboss! Ti sto inviando un file .rar checontiene tutte le emoji di cui hai bisogno. Sono 23 in tutto. Tutto quello che devi fare è scaricare il file, estrarlo e caricare le immagini su Discord come Custom emoji. Puoi farlo tutto in una volta e puoi solo lasciare i titoli emoji! Ad ogni modo: se hai bisogno di cambiare qualche impostazione, ti basta digitare !configure nel tuo server e potrai rifare questo di nuovo.

source: If you have any questions just ask an admin.
fr: Si vous avez une question, demandez à un administrateur.
it: Se avete domande basta chiedere a un admin.

source: Meowth! Welcome to {server.name}, {new_member_name.mention}!
fr: Meowth! Bienvenue à {server.name}, {new_member_name.mention}!
it: Benvenuto in {server.name}, {new_member_name.mention}!

source: Set your team by typing {team_command} without quotations.
fr: Définissez votre équipe en tapant {team_command} sans les guillemets.
it: Imposta il tuo team digitando {team_command} senza virgolette.

source: WARNING: no default channel configured. Unable to send welcome message.
fr: ATTENTION: aucun salon par défaut n'est configuré. Impossible d'envoyer le message de bienvenue.
it: AVVISO: nessun canale predefinito configurato. Impossibile inviare il messaggio di benvenuto.

source: Error occured while trying to save!
fr: Une erreur s'est produite lors de l'enregistrement de sauvegarde!
it: C’è stato un errore mentre provavo a salvare il file!

source: Meowth! My roles are ranked lower than the following team roles: **{higher_roles_list}** Please get an admin to move my roles above them!
fr: Meowth! Mes rôles sont inférieurs aux rôles suivants: **{higher_roles_list} ** Contacter un administrateur pour déplacer mes rôles au-dessus d'eux!
it: Il mio ruolo è gerarchicamente inferiore ai seguenti ruoli dei team **{higest_roles_list}** Per favore segnala ad un admin di spostare il mio ruolo sopra il loro!

source: Meowth! You already have a team role!
fr: Meowth! Vous avez déjà un rôle d'équipe!
it: Hai già un Team impostato come ruolo!

source: WARNING: Role {team_role} in team_dict not configured as a role on the server!
fr: ATTENTION: Le rôle {team_role} dans team_dict n'est pas configuré comme un rôle sur le serveur!
it: ATTENZIONE: il Ruolo {team_role} in team_dict non è configurato come un ruolo nel server!

source: Meowth! "{entered_team}" isn't a valid team! Try {available_teams}
fr: Meowth! "{entered_team}" n'est pas une équipe valide ! Essayez {available_teams}
it: “{entered_team}” non è un team valido! prova {available_teams}

source: Meowth! The "{entered_team}" role isn't configured on this server! Contact an admin!
fr: Meowth! Le rôle "{entered_team}" n'est pas configuré sur ce serveur ! Contacter un administrateur!
it: Il ruolo “{entered_team}” non è configurato su questo server! Contatta un admin!

source: Meowth! Added {member} to Team {team_name}! {team_emoji}
fr: Meowth! {member} ajouté à l'équipe {team_name}! {team_emoji}
it: Aggiunto {member} al Team {team_name}! {team_emoji}

source: Meowth! I can't add roles!
fr: Meowth! Je ne peux pas ajouter de rôle!
it: Non posso aggiungere questo ruolo!

source: Meowth! Please use one of the following channels for **!want** commands: {want_channel_list}
fr: Meowth! Utilisez l'un des salons suivants pour les commandes **!want **: {want_channel_list}
it: Per favore usa uno dei seguenti canali per il comando **!want**: {want_channel_list}

source: Meowth! {member}, I already know you want {pokemon}!
fr: Meowth! {member}, je sais déjà que vous voulez {pokemon}!
it: {member}, Immagino volessi dire {pokemon}!

source: Meowth! Got it! {member} wants {pokemon}
fr: Meowth! Compris! {member} veut {pokemon}
it: Fatto! {member} vuole {pokemon}

source: Meowth! Please restrict wild reports to city channels or the default channel!
fr: Meowth! Limitez les rapports sauvages aux salons de la ville ou dans le salon par défaut!
it: Per favore limitati a riportare i pokemon selvatici nel canale apposito o nel canale di default!

source: Meowth! Give more details when reporting! Usage: **!wild <pokemon name> <location>**
fr: Meowth! Donnez moi plus d'informations s'il vous plaît! Utilisez: **!wild <nom du pokemon> <localisation>**
it: Fornisci più dettagli quando riporti un pokemon! Utilizza questa sintassi **!wild <nome pokemon> <luogo>**

source: Meowth! Click here for directions to the wild {pokemon}!
fr: Meowth! Cliquez ici pour obtenir les directions vers le {pokemon} sauvage!
it: Clicca qui per le indicazione di {pokemon}!

source: This is just my best guess!
fr: Voici ma meilleure suggestion!
it: Questa è solo la mia ipotesi migliore!

source: Meowth! Wild {pokemon} reported by {member}! Details:{location_details}
fr: Meowth! Un {pokemon} sauvage a été reporté par {member}! Détails: {location_details}
it: {pokemon} selvatico segnalato da {member}! Dettagli:{location_details}

source: Meowth! **!wild** commands have been disabled.
fr: Meowth! Les commandes **!wild** ont été désactivées.
it: Il comando **!wild** è stato disabilitato.

source: Meowth! Please restrict raid reports to a city channel or the default channel!
fr: Meowth! Veuillez limiter les rapports de raid à un salon de ville ou dans le salon par défaut!
it: Per favore limitati a riportare i raid nel canale apposito o nel canale di default!

source: Meowth! Give more details when reporting! Usage: **!raid <pokemon name> <location>**
fr: Meowth! Donnez moi plus d'informations s'il vous plaît! Utilisez: **!raid <nom du pokemon> <localisation>**
it: Fornisci più dettagli quando riporti un raid! Utilizza questa sintassi **!raid <nome pokemon> <luogo>**

source: Meowth! The Pokemon {pokemon} does not appear in raids!
fr: Meowth! Le Pokemon {pokemon} n'apparaît pas en raid!
it: Il Pokemon col seguente nome {pokemon} NON appare nei raid!

source: Meowth! Click here for directions to the raid!
fr: Meowth! Cliquer ici pour obtenir les directions pour le raid!
it: Clicca qui per le indicazioni del raid!

source: Weaknesses: {weakness_list}
fr: Faiblesses: {weakness_list}
it: Debolezze: {weakness_list}

source: Meowth! {pokemon} raid reported by {member}! Details:{location_details}. Coordinate in {raid_channel}
fr: Meowth! Un {pokemon} a été reporté dans un raid par {member}! Détails: {location_details}. Coordonner dans {raid_channel}
it: {pokemon} raid segnalato da {member}! Dettagli: {location_details}. Coordinate in {raid_channel}

source: Meowth! {pokemon} raid reported by {member}! Details:{location_details}. Coordinate here! Reply to this message with **!coming** (`!coming [number]` for trainers with you) to say you are on your way, and reply with **!here** once you arrive. If you are at the raid already, reply with **!here** (`!here [number]` for trainers with you). If you are interested in the raid and want to wait for a group, use **!maybe**. If your plans change, reply with **!cancel** if you are no longer on the way or if you have left the raid. You can set the time remaining with **!timerset H:MM** and access this with **!timer**. You can see the list of trainers interested with **!interest**, trainers on their way with **!otw**, trainers at the raid with **!waiting**, or all lists with **!lists**. Once you start a raid, use **!starting** to clear the waiting list to allow the next group to coordinate. Sometimes I'm not great at directions, but I'll correct my directions if anybody sends me a maps link. This channel will be deleted in 2 hours or five minutes after the timer expires.
fr: Meowth! Raid de {pokemon} rapporté par {member}! Détails: {location_details}. Coordonnez ici! Répondez à ce message avec **!coming** (`!coming [chiffre]` pour les joueurs avec vous) pour dire que vous êtes sur votre chemin. Une fois que vous arrivez, ou si vous êtes déjà au raid, répondez avec **!here** (`!here [chiffre]` pour les joueurs avec vous). Si vous êtes intéressé(e) par le raid et souhaitez attendre un groupe, utilisez **!maybe**. Si vos plans changent, répondez avec **!cancel** si vous n'êtes plus sur le chemin ou si vous avez quitté le raid. Vous pouvez régler le temps restant avec **!timerset H:MM** et voir le temps restant avec **!timer**. Vous pouvez voir la liste des joeurs intéressés avec **!interest**, les joueurs en route avec **!otw**, le joueurs au raid avec **!waiting**, ou toutes ces listes ensemble avec **!lists**. Une fois que vous démarrez un raid, utilisez **!starting** pour effacer la liste d'attente pour permettre au prochain groupe de se coordonner. Parfois, je ne suis pas bon avec les directions, mais je vais corriger mes directions si quelqu'un m'envoie un lien de Google Maps. Ce salon sera supprimé dans 2 heures si aucun temps d'expiration a été spécifié pour le raid.
it: {pokemon} raid segnalato da {member}! Dettagli: {location_details}. Coordinate qui! Rispondi a questo messaggio con **!coming** ( `!coming [numero]` se ci sono più giocatori con te) per dire che sei/siete per strada e stai arrivando, e rispondi con **!here** una volta che arriverai. Se ti trovi già sul posto del raid, rispondi con **!here** (`!here [numero]` se ci sono più giocatori con te). se sei interessato al raid e vuoi aspettare che ci sia un gruppo, usa **!maybe**. Se cambi idea, rispondi con **!cancel** se vuoi abbandonare il raid. Puoi impostare il tempo rimanente con **!timerset H:MM** e visualizzarlo in seguito con **!timer**. Puoi vedere la lista degli allenatori interessati con **!interest**, gli allenatori che stanno arrivando con **!otw**, gli allenatori che sono già al raid con **!waiting**, o la lista completa digitando **!lists**. Quando state per iniziare un raid, usa **!starting** per cancellare la lista di attesa e per permettere ad altri gruppi di coordinarsi. Alcune volte non sono bravissimo con le indicazioni, ma tu puoi correggerle se nessuno mi manda un link alla mappa. Questo canale verra eliminato tra 2 ore oppure 5 minuti dopo che il timer del raid è esaurito.

source: Meowth! Hey {member}, if you can, set the time left on the raid using **!timerset H:MM** so others can check it with **!timer**.
fr: Meowth! {member}, si vous le pouvez, définissez le temps restant sur le raid en utilisant **!timerset H:MM** afin que les autres puissent le voir avec **!timer**.
it: Hey {member}, se puoi, imposta il tempo rimanente per il raid usando **!timerset H:MM** così che altri giocatori potranno consultarlo tramite il comando **!timer**.

source: Meowth! {member}, I already know you don't want {pokemon}!
fr: Meowth! {member}, je sais déjà que vous ne voulez pas {pokemon}!
it: {member}, Immagino non volessi dire {pokemon}!

source: Meowth! Got it! {member} no longer wants {pokemon}
fr: Meowth! Compris! {member} ne cherche plus {pokemon}!
it: Fatto! {member} non vuole più {pokemon}

source: Meowth! This raid's timer has already expired as of {expiry_time}!
fr: Meowth! La minuterie de ce raid a déjà expiré à partir de {expiry_time}!
it: Il timer del raid è già scaduto alle {expiry_time}!

source: Meowth! This raid will end at {expiry_time}!
fr: Meowth! Le raid se termine à {expiry_time}!
it: Questo raid finirà alle {expiry_time}!

source: Meowth! No one told me when the raid ends, so I'm assuming it will end at {expiry_time}!
fr: Meowth! Personne ne m'a dit quand le raid se termine, alors je suppose que ça se terminera à {expiry_time}!
it: Nessuno mi ha detto tra quanto il raid finirà, quindi ho assunto che terminerà alle {expiry_time}!

source: Meowth...that's too long. Raids currently last no more than two hours...
fr: Meowth... c'est trop long. Les raids ne durent actuellement pas plus de deux heures.
it: Questo è troppo lungo. i Raid attualmente non rimangono per più di due ore..

source: Meowth...I can't do that! No negative numbers, please!
fr: Meowth... Je ne peux pas faire ça! Pas de chiffres négatifs, s'il vous plaît!
it: Non posso farlo! Nessun numero negativo, grazie!

source: Meowth...I couldn't understand your time format...
fr: Meowth... Je n'arrive pas à comprendre le format de l'heure...
it: Non riesco a capire l’orario impostato, utilizza questo formato H:MM.

source: Meowth... I couldn't understand your time format. Try again like this: !timerset H:MM
fr: Meowth... Je n'arrive pas à comprendre votre format pour l'heure. Essayez de nouveau comme ceci: **!timerset H:MM**
it: Non riesco a capire l'orario impostato, utilizza questo formato: !timerset H:MM

source: Meowth! {0} is interested!
fr: Meowth! {0} est intéressé(e)!
it: {0} sta aspettando sotto il raid!

source: Meowth! {member} is interested with a total of {trainer_count} trainers!
fr: Meowth! {member} est intéressé(e) avec un total de {trainer_count} joueurs!
it: {member} è al raid con {trainer_count} giocatori!

source: Meowth! {member} is on the way!
fr: Meowth! {member} est en chemin!
it: {member} è per strada!

source: Meowth! {member} is on the way with a total of {trainer_count} trainers!
fr: Meowth! {member} est en chemin avec un total de {trainer_count} joueurs!
it: {member} è per strada con {trainer_count} giocatori!

source: Meowth! {member} is at the raid!
fr: Meowth! {member} attend au raid!
it: {member} sta aspettando sotto il raid!

source: Meowth! {member} is at the raid with a total of {trainer_count} trainers!
fr: Meowth! {member} est au raid avec un total de {trainer_count} joueurs!
it: {member} è al raid con {trainer_count} giocatori!

source: Meowth! {member} is no longer interested!
fr: Meowth! {member} n'est plus intéressé(e)!
it: {member} non non è più interessato!

source: Meowth! {member} and their total of {trainer_count} trainers are no longer interested!
fr: Meowth! {member} et le total de {trainer_count} joueurs avec lui ne sont plus intéressé(e)s!
it: {member} e un totale di {trainer_count} giocatori NON sono più interessati!

source: Meowth! {member} has left the raid!
fr: Meowth! {member} a quitté le raid!
it: {member} ha lasciato il raid!

source: Meowth! {member} and their total of {trainer_count} trainers have left the raid!
fr: Meowth! {member} et le total de {trainer_count} joueurs avec lui ont quitté le raid!
it: {member} e un totale di {trainer_count} giocatori con lui hanno lasciato il raid!

source: Meowth! {member} is no longer on their way!
fr: Meowth! {member} n'est plus en chemin!
it: {member} NON è più per strada!

source: Meowth! {member} and their total of {trainer_count} trainers are no longer on their way!
fr: Meowth! {member} et le total de {trainer_count} joueurs avec lui ne sont plus en chemin!
it: {member} e un totale di {trainer_count} giocatori con lui NON sono più per strada!

source: Meowth! Someone has suggested a different location for the raid than what I guessed! Trainers {trainer_list}: make sure you are headed to the right place!
fr: Meowth! Quelqu'un a suggéré un lieu différent pour le raid que ce que j'ai supposé! Joueurs {trainer_list}: assurez-vous d'aller au bon endroit!
it: Qualcuno ha suggerito una posizione differente per il raid rispetto a quella che ho indovinato! Giocatori {trainer_list}: assicuratevi di esser diretti nel posto giusto!

source: Meowth! Exactly *how many* are interested? There wasn't a number anywhere in your message. Or, just say `!maybe` if you're by yourself.
fr: Meowth! Exactement *combien* sont intéressés? Il n'y avait aucun numéro dans votre message. Ou dites simplement **!maybe** si vous êtes seul.
it: Esattamente *quanti* sono interessati? Non c’è stato nessun numero da nessuna parte nel tuo messaggio. oppure, digita **!maybe** se sei interessato solo tu.

source: Meowth...I got confused because there were several numbers in your message. I don't know which one is the right one.
fr: Meowth... Je me suis confondu parce qu'il y avait plusieurs chiffres dans votre message. Je ne sais pas lequel est le bon.
it: Meowth…Sono confuso perché c’erano diversi numeri nel tuo messaggio. Non so quale di questi è quello corretto.

source: Meowth! Exactly *how many* are coming? There wasn't a number anywhere in your message. Or, just say **!coming** if you're by yourself.
fr: Meowth! Exactement *combien* arrivent-ils? Il n'y avait aucun numéro dans votre message. Ou dites simplement **!coming ** si vous êtes seul.
it: Esattamente *quanti* stanno arrivando? Non c’è stato nessun numero da nessuna parte nel tuo messaggio. Oppure, digita **!coming** se stai arrivando da solo.

source: Meowth! Exactly *how many* are here? There wasn't a number anywhere in your message. Or, just say **!here** if you're by yourself.
fr: Meowth! Exactement *combien* sont-ils ici? Il n'y avait aucun numéro dans votre message. Ou dites simplement **!here ** si vous êtes seul.
it: Esattamente *quanti* sono lì? Non c’è stato nessun numero da nessuna parte nel tuo messaggio. Oppure, digita **!here** se sei arrivato da solo.

source: including {trainer_list} and the people with them! Let them know if there is a group forming
fr: avec {trainer_list} et les joueurs avec eux! Faites-leur savoir s'il y a un groupe qui se forme.
it: tra cui {trainer_list} e i giocatori con loro! Tenetelo presente e aspettate se possibile

source: Meowth! {trainer_count} interested{including_string}!
fr: Meowth! {trainer_count} intéressé(s){including_string}!
it: {trainer_count} interessati {including_string}!

source: including {trainer_list} and the people with them! Be considerate and wait for them if possible
fr: avec {trainer_list} et les joueurs avec eux! Merci de les attendre si possible.
it: tra cui {trainer_list} e i giocatori con loro! Tenetelo presente e aspettate se possibile

source: Meowth! {trainer_count} on the way{including_string}!
fr: Meowth! {trainer_count} en chemin{including_string}!
it: {trainer_count} per strada{including_string}!

source: including {trainer_list} and the people with them! Be considerate and let them know if and when you'll be there
fr: avec {trainer_list} et les personnes avec eux! Merci de préciser dans combien de temps vous arrivez.
it: tra cui {trainer_list} e i giocatori con loro! Tienilo presente e fate sapere se e quando sarete lì

source: Meowth! {trainer_count} waiting at the raid{including_string}!
fr: Meowth! {trainer_count} attend(ent) au raid{including_string}!
it: {trainer_count} aspettano sotto il raid {including_string}!

source: Current Raids in {0}:
fr: Raids actuels dans {0}:
it: Raid correnti in {0}:

source: {0.mention} - interested = {1}, {2} = {3}, {4} = {5}, Ends at {6}
fr: {0.mention} - intéressé(s) = {1}, {2} = {3}, {4} = {5}, Fini à {6}
it: {0.mention} - interessati = {1}, {2} = {3}, {4} = {5}, Finisce alle {6}

source: Meowth! No active raids! Report one with **!raid <name> <location>**.
fr: Meowth! Il n'y a pas de raids actifs! Signaler un avec: **!raid <nom du pokemon> <localisation>**.
it: Fornisci più dettagli quando riporti un raid! Utilizza questa sintassi !wild <nome pokemon> <luogo>.

source: Meowth! The group that was waiting is starting the raid! Trainers {trainer_list}, please respond with {here_emoji} or !here if you are waiting for another group!
fr: Meowth! Le groupe qui attendait vient de lancer le raid! Joueurs {trainer_list}, merci de répondre avec {here_emoji} ou avec **!here** si vous faites un autre groupe!
it: Il gruppo che stava aspettando sta iniziando il raid! Allenatori {trainer_list}, rispondi con {here_emoji} o con !here se stai aspettando un altro gruppo!

source: Meowth! How can you start when there's no one waiting at this raid!?
fr: Meowth! Comment pouvez-vous commencer quand il n'y a personne en attente pour ce raid!?
it: Come puoi iniziare se non c’è nessuno che aspetta questo raid !?

source: Meowth! Hey {member}, I don't know if you meant **!coming** to say that you are coming or **!otw** to see the other trainers on their way
fr: Meowth! {member}, je ne sais pas si vous vouliez dire **!coming** pour dire que vous venez ou **!otw** pour voir les autres joueurs en route.
it: Hey {member}, non ho capito se volevi dire **!coming** per dire che stavi arrivando o **!otw** per vedere gli altri giocatori che sono già sulla strada per il raid

source: Meowth! Hey {member}, I don't know if you meant **!maybe** to say that you are interested or **!interest** to see the other trainers interest
fr: {membre}, je ne sais pas si vous vouliez dire **!maybe** pour dire que vous êtes intéressé(e) ou **!interest** pour voir l'intérêt des autres joueurs.
it: Hey {member}, non ho capito se volevi dire **!maybe** per dire che sei interessato o **!interest** per vedere gli altri giocatori interessati al raid

source: This channel has been reported as a duplicate and has been deactivated. Check the channel list for the other raid channel to coordinate in! If this was an error you can reset the raid with **!timerset**
fr: Ce salon a été signalé comme une duplication et a été désactivé. Vérifiez la liste des salons pour l'autre salon de raid à coordonner! S'il s'agissait d'une erreur, vous pouvez réinitialiser le raid avec **!timerset**
it: Questo canale è stato riportato come un duplicato ed è stato disattivato. Controlla la lista dei canali per coordinare gli altri raid! se questo è stato un errore puoi resecare il raid con **!timerset**

source: Meowth! We're missing the new location details! Usage: **!location <location>**
fr: Meowth! Nous manquons les détails du nouvel emplacement! Utilisez: **!location <location>**
it: Manca il nuovo dettagli della posizione! Utilizzo: **!location <posizione>**

source: Meowth! Someone has suggested a different location for the raid! Trainers {trainer_list}: make sure you are headed to the right place!
fr: Quelqu'un a suggéré un lieu différent pour le raid! Joueurs {trainer_list}: assurez-vous d'aller au bon endroit!
it: Qualcuno ha suggerito una posizione differente per il raid! Giocatori {trainer_list}: assicuratevi di esser diretti nel posto giusto!
